Repository: mlang/img2brl
Catalog: translation/*.po
Languages: de, fa, fr, hu

source: German
fa: آلمانی
fr: allemand
hu: Német

source: English
de: Englisch
fa: انگلیسی
fr: anglais
hu: angol

source: French
de: Französisch
fa: فرانسوی
hu: francia

source: Hungarian
de: Ungarisch
fa: مجاری
fr: hongrois

source: Italian
de: Italienisch
fa: ایتالیایی
fr: italien
hu: olasz

source: Amount of characters a line of the braille output is not allowed to exceed.
de: Die Anzahl der Zeichen die die Breite der Brailleausgabe nicht überschreiten darf.
fa: تعداد حروف یک خط خروجی بریل نباید از حد مجاز تجاوز کند.

source: Send an image file:
de: Sende eine Bilddatei:
fa: یک فایل تصویری بفرستید:
fr: Envoyer un fichier image :
hu: Küldj egy képfájlt:

source: or
de: oder
fa: یا
fr: ou
hu: vagy

source: Enter URL to image:
de: URL zum Bild eingeben:
fa: آدرس اینترنتی تصویر را وارد کنید:
fr: Entrer une URL pointant sur une image :
hu: Add meg az URLt a képhez:

source: Options:
de: Optionen:
fa: گزینه ها:
hu: Beállítások:

source: Trims edges that are the background color from the image.
de: Entfernt Ränder die dem Hintergrund des Bildes gleichen.
fa: لبه های تصویر را که رنگ پس زمینه هستند برش میدهد.

source: trim edges
de: Ränder trimmen
fa: لبه ها را برش بدهید
fr: supprimer les bords
hu: széleket levágni

source: Enhances the contrast of a color image by mapping the darkest 2 percent of all pixels to black and the brightest 1 percent to white.
de: Verbessert den Kontrast eines Farbbildes indem die dunkelsten 2 Prozent aller Pixel schwarz, und die hellsten 1 Prozent weiß gefärbt werden.
fa: کنتراست تصویر رنگی را از طریق اختصاص دادن تاريكترين ٢ درصد از تمام پیکسل ها به سیاه و روشن ترین ١ درصد به سفید بهتر میکند.

source: increase contrast
de: Kontrast erhöhen
fa: کنتراست را افزایش دهید
fr: augmenter le contraste
hu: kontrasztot emelni

source: Negates the colors in the reference image.
de: Invertiert die Farben des Bildes.
fa: در تصویر مرجع رنگ ها را معکوس میکند.

source: invert
de: invertieren
fa: معکوس کنید
fr: inverser
hu: invertálni

source: Scales image such that it uses at most the specified amount of characters horizontally.
de: Skalliert das Bild so, das es die angegebene Zeilenlänge nicht überschreitet.
fa: مقیاس و اندازه تصویر را به قدری تغییر میدهد که حد اکثر تعداد تعیین شده حروف به طور افقی استفاده شود.

source: {1} max {2} {3}
de: {1} maximal {2} {3}
fa: {1} حد اکثر {2} {3}

source: resize to
de: verkleinern auf
fa: تغییر اندازه به
fr: retailler avec
hu: méretet változtatni

source: columns
de: Zeichen
fa: ستون ها
fr: colonnes
hu: oszlopok

source: Translate to Braille
de: In Braille übersetzen
fa: به بریل ترجمه کنید
fr: Traduire en Braille
hu: Forditás Brailleba

source: Tactile Image Viewer
de: Taktiler Bildbetrachter
fa: نمایشگر تصویر لمس کردنی
fr: Visionneur d'image tactile
hu: Tapintható Kép Megtekintö

source: Supported image formats
de: Unterstützte Bildformate
fa: فرمت های تصویر پشتیبانی شده
fr: Formats d'images supportés
hu: Támogatott kép formátumok

source: Processing time was {3} {4} ({1} {2})
de: Die Verarbeitungszeit betrug {3} {4} ({1} {2})
fa: زمان پردازش عبارت بود از {3} {4} ({1} {2})
fr: Le temp de traitement a été de {3} {4} ({1} {2})
hu: A feldolgozáshoz szükséges idö {3} {4} ({1} {2}) volt

source: microseconds
de: Mikrosekunden
fa: میکروثانیه
fr: microsecondes
hu: mikromásodperc

source: seconds
de: Sekunden
fa: ثانیه
fr: secondes
hu: másodperc

source: Unicode braille
de: Unicode Braille-Zeichen
fa: یونیکد بریل
fr: le Braille Unicode
hu: Unicode brailleba

source: img2brl &mdash; Convert images to Braille
de: img2brl &mdash; Bilder tastbar machen
fa: img2brl &mdash; تبدیل تصاویر به خط بریل
fr: img2brl &mdash; Convertit des images en Braille
hu: img2brl &mdash; Képeket Brailleba fordítani

source: Translate images from various {1} to {2}.
de: Übersetzt Bilder verschiedenster {1} in {2}.
fa: تصویر را از {1} متنوع به {2} ترجمه کنید.
fr: Traduire des images de divers {1} vers {2}.
hu: Külömböző {1} képeit fordítja {2}.

source: formats
de: Formate
fa: فرمت ها
hu: formátumok

source: Install Firefox Add-on
de: Firefox-Erweiterung installieren
fa: افزودنی فایرفاکس را نصب کنید
fr: Installer le greffon Firefox
hu: Firefox kiegészítőt telepíteni

source: There is an {1}.
de: Es gibt eine {1}.
fa: یک {1} وجود دارد.
fr: Il y a une {1}.
hu: Létezik egy {1}.

source: Source code? {1} or {2}.
de: Quellcode? {1} oder {2}.
fa: کد منبع؟ {1} یا {2}.
fr: Code source ? {1} ou {2}.
hu: Forráskód? {1} vagy {2}.

source: Powered by {1}, {2}, {3}, {4}, {5} and {6} running on {7} ({8}).
de: Erstellt mit {1}, {2}, {3}, {4}, {5} und präsentiert mit {6} auf {7} ({8}).
fa: طراحی شده توسط {1}, {2}, {3}, {4}, {5} و {6} قابل کار بر روی {7} ({8}).
fr: Propulsé par {1}, {2}, {3}, {4}, {5} et {6} tournant sur {7} ({8}).

source: version
fa: نسخه
hu: verzió

source: http://en.wikipedia.org/wiki/Unicode_braille
de: http://de.wikipedia.org/wiki/Unicode-Block_Braille-Zeichen
fr: http://fr.wikipedia.org/wiki/Table_des_caract%C3%A8res_Unicode/U2800

source: Spanish
fr: espagnol

source: Farsi
fr: persan
hu: perzsa
